---
kind: property
id: P:Autodesk.Revit.DB.Lighting.LightType.ColorFilter
source: html/c9d73694-2f9b-9801-6310-484b337d4069.htm
---
# Autodesk.Revit.DB.Lighting.LightType.ColorFilter Property

The light filter color.

## Syntax (C#)
```csharp
public Color ColorFilter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null